---
kind: method
id: M:Autodesk.Revit.DB.PointLocationOnCurve.#ctor(Autodesk.Revit.DB.PointOnCurveMeasurementType,System.Double,Autodesk.Revit.DB.PointOnCurveMeasureFrom)
source: html/60d41ecf-987c-b8b9-abd5-152cb86dd34f.htm
---
# Autodesk.Revit.DB.PointLocationOnCurve.#ctor Method

Constructs a new instance of a class, with given or default values, to place a point on a curve.

## Syntax (C#)
```csharp
public PointLocationOnCurve(
	PointOnCurveMeasurementType measType,
	double measValue,
	PointOnCurveMeasureFrom measFrom
)
```

## Parameters
- **measType** (`Autodesk.Revit.DB.PointOnCurveMeasurementType`)
- **measValue** (`System.Double`)
- **measFrom** (`Autodesk.Revit.DB.PointOnCurveMeasureFrom`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration